docs: 精简&更新文档
